src/cf/Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СпецификацииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СпецификацииНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// В программе наименование основной спецификации, если она всего одна, по умолчанию совпадает с наименованием продукции.
// Если спецификации уже задано наименование - не такое, как у продукции - то оно изменено не будет.
//
// Параметры:
//  ОсновнаяСпецификацияНоменклатуры - СправочникСсылка.СпецификацииНоменклатуры - контролируемая спецификация
//  Номенклатура					 - СправочникСсылка.Номенклатура - владелец спецификации
//  Наименование					 - Строка - новое наименование продукции
//  ПараметрыЗаписи					 - Структура - может содержать ключ НаименованиеДоИзменения (наименование продукции)
//
Процедура ИсправитьНаименованиеСпецификации(Спецификация, Номенклатура, Наименование, ПараметрыЗаписи) Экспорт
	
	Если Не ЗначениеЗаполнено(Спецификация) Тогда
		Возврат;
	КонецЕсли;
	
	Если НесколькоСпецификацийНоменклатуры(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеСпецификации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "Наименование");
	
	Если НаименованиеСпецификации = Наименование Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеДоИзменения = "";
	ПараметрыЗаписи.Свойство("НаименованиеДоИзменения", НаименованиеДоИзменения);
	
	Если Не ПустаяСтрока(НаименованиеДоИзменения) 
		И Не ПустаяСтрока(НаименованиеСпецификации)
		И НаименованиеСпецификации <> НаименованиеДоИзменения Тогда
		// Пользователь задал спецификации особое наименование. Сохраним его
		Возврат;
	КонецЕсли;
	
	ОбъектОсновнаяСпецификация = Спецификация.ПолучитьОбъект();
	ОбъектОсновнаяСпецификация.Наименование = Наименование;
	ОбъектОсновнаяСпецификация.Записать();
	
КонецПроцедуры

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Спецификация	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Спецификация";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьСпецификации";
	КомандаПечати.Представление = НСтр("ru = 'Спецификация'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Спецификация сырья и материалов'");
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	КомандаПечати.Порядок       = 1;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НесколькоСпецификацийНоменклатуры(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СправочникСпецификаций.Ссылка) КАК КоличествоСпецификаций
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры КАК СправочникСпецификаций
	|ГДЕ
	|	СправочникСпецификаций.Владелец = &Номенклатура
	|	И СправочникСпецификаций.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоСпецификаций > 1;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Устанавливает спецификацию основной для указанной продукции (услуги),
// если для нее не установлена основной другая спецификация.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - продукция или услуга, требующая расхода материалов по указанной
//                 спецификации.
//  ОбработкаОбновления - Булево - Истина, если действие выполняется в ходе обработки обновления информационной базы.
//
Процедура УстановитьОсновной(Номенклатура, Спецификация, ОбработкаОбновления = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнаяСпецификация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ОсновнаяСпецификацияНоменклатуры");
	Если ЗначениеЗаполнено(ОсновнаяСпецификация) Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Номенклатура.ПолучитьОбъект();
	
	Если Объект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОсновнаяСпецификацияНоменклатуры = Спецификация;
	
	Если ОбработкаОбновления Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
	Иначе
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
